let newList=[
    {id:0,date:'2020-3-12',title:'浙江湖州检方开展公益诉讼专项监督助力疫情阻击战',main:[
        '2月12日上午,由浙江省湖州市检察院副检察长费会平带队,负责公益诉讼检察工作的该市检察院及吴兴区检察院第五检察部,协同该市市场监督管理局,对湖州市辖区内与群众“菜篮子”关系密切的浙北农产品集散中心、仁皇山农贸市场、凯莱国际农贸市场等地进行实地联合巡查, 着重检查活禽、水产、生鲜、肉类市场检验检疫、食品安全等领域可能存在的市场监管漏洞,预防和杜绝野生动物非法交易。同时,针对近期人民群众反映强烈的肉类、蔬菜价格波动情况,与价格监督检查和反不正当竞争分局的工作人员进行了当面磋商。',
        '这次实地巡查是湖州市检察院近日制定出台《湖州市检察机关关于开展新型冠状病毒肺炎疫情防控公益诉讼专项监督活动方案》的一部分内容。',
        '方案明确将公益诉讼检察工作融入全市疫情防控工作大局,加强同相关部门的沟通联系,支持、督促行政机关正确依法履行职责,稳妥有效助力当地疫情防控工作,做到帮忙不添乱。',
        '方案要求全市检察机关立足本地实际,重点监督患有新型冠状病毒感染肺炎以或疑似病症的患者不按规定接受检疫、强制隔离治疗,故意传播病毒,危害不特定对象生命健康;相关行政部门工作人员严重不负责任,不履行或者不认真履行防治监管职责,导致新型冠状病毒感染肺炎传播或流行;在疫情防控期间违反有关市场经营、价格管理等规定,哄抬物价、牟取暴利;非法猎捕、杀害、收购、运输、出售野生动物;生鲜、肉类市场应检验检疫而未检验检疫;企业、经营者生产、销售伪劣或不符合保障人体健康的国家标准、行业标准的防治、防护产品、医疗器械、医用卫生材料;企业、经营者生产、销售用于防治传染病的假药、劣药;企业、经营者生产、销售不符合食品安全标准的食品;未取得医师执业资格而非法行医;假借疫情防控的名义,利用广告对所推销的商品虚假宣传等其他违反《湖州市关于加强新型冠状病毒感染的肺炎疫情防控工作的通告》的行为等10个方面。',
        '费会平表示,将在认真排摸线索的基础上,对于在专项活动中发现的相关行政机关怠于履行法定职责,采用诉前磋商措施方式督促、支持行政机关依法履职。经磋商,行政机关拒不履职纠错的,依法发出检察建议。将公益诉讼办案和促进行业整治、区域治理相结合,针对发现的共性、普遍性问题,主动为当地党委政府加强和改进疫情防控工作提出对策建议。对于损害国家利益或社会公共利益的单位和个人,符合提起民事公益诉讼、刑事附带民事公益诉讼条件的,坚决按照程序提起诉讼。'
    ]},
    {id:1,date:'2020-3-12',title:'湖州市关于加强新型冠状病毒感染的肺炎疫情防控工作的通告(第4号)',main:[
        '关于加强新型冠状病毒感染的肺炎疫情防控工作的通告',
        '(第4号)',
        '为加强新型冠状病毒感染的肺炎疫情防控工作，有效减少人员聚集，阻断疫情传播，更好保障人民群众生命安全和身体健康，按照党中央、国务院和省委、省政府防控工作部署，根据《中华人民共和国突发事件应对法》《中华人民共和国传染病防治法》和本市重大突发公共卫生事件一级响应机制的有关规定，经市委、市政府研究决定，现就延迟本市企业复工紧急通知如下：',
        '一、本市区域内各类企业原则上不早于2月10日0时前复工，具体复工时间另行通知。涉及保障城市运行必需（供水、供气、供电、通讯等行业）、疫情防控必需（医疗器械、药品、防护品生产和销售等行业）、群众生活必需（超市卖场、食品生产和供应等行业）及其他涉及重要国计民生的相关企业，经行业主管部门或所在乡镇人民政府（街道办事处）审核，报区县（南太湖新区）疫情防控工作领导小组办公室同意后，应及时复工。',
        '二、因手持订单急需复工或以本地员工为主且具备复工条件的企业，经所在乡镇人民政府（街道办事处）或行业主管部门审核，报区县（南太湖新区）疫情防控工作领导小组办公室同意后，可提早复工。',
        '三、春节期间不停工企业，可在不扩大职工范围的前提下继续保持生产，需向所在乡镇人民政府（街道办事处）报备。',
        '四、各区县政府（南太湖新区管委会）要认真履行属地责任，加强对企业开复工情况的监督检查。企业要落实主体责任，强化安全生产管理，加强疫情防控知识宣传和培训，配备体温检测设备，建立员工健康日报告制度。',
        '五、针对确因工作需要近期返湖的人员，各地各相关部门和所在企业要加强检疫查验和健康防护，所在企业要及时报告相关信息，对来自或去过疫情重点地区的人员一律严格落实医学观察、隔离等措施，做到全覆盖。',
        '六、用人单位须依法保障员工合法权益。',
        '湖州市新型冠状病毒感染的肺炎疫情防控领导小组'
    ]},
    {id:2,date:'2019-07-04',title:'工业互联网夯实浙江数字经济',main:[
        '数字经济是浙江的一张“金名片”，也是浙江参与长三角一体化发展国家战略的优势所在。',
        '浙江省委省政府提出，浙江大湾区是长三角世界级城市群的“金南翼”，高起点谋划一批“万亩千亿”新产业平台和若干个千亿级先进制造业集群，打造现代化建设先行区、数字经济创新高地、高质量发展新引擎，为长三角重大生产力布局优化、迈向世界级发展高地贡献浙江力量。',
        '近期，在杭州余杭临平新城核心区，一个规划建筑面积约78万平方米、首期建筑面积26万平方米的中国（杭州）工业互联网小镇已投入运营。小镇集聚5G技术、信息软件、工业App、人工智能、云计算、大数据、物联网等领域的服务商，打造面向长三角地区的工业互联网产业聚集区。',
        '浙江省工业和信息化研究院副院长姜华表示，长三角地区是我国经济最具活力、开放程度最高、创新能力最强的区域之一。浙江着力发展数字经济，加强工业经济主平台建设，主动融入长三角一体化发展中。'
    ]},
    {id:3,date:'2019-07-04',title:'打造长三角能源互联网共同体',main:[
        '习近平总书记明确阐述过能源革命的全新内涵，即“四个革命、一个合作”：推动能源消费革命，抑制不合理能源消费；推动能源供给革命，建立多元供应体系；推动能源技术革命，带动产业升级；推动能源体制革命，打通能源发展快车道；全方位加强国际合作，实现开放条件下能源安全。',
        '能源互联网发展是践行能源革命的有效战略途径。能源互联网是“互联网+智慧能源”的简称，是一种互联网与能源生产、传输、存储、消费及能源市场深度融合的能源产业发展新形态，具有设备智能、多能协同、信息对称、供需分散、系统扁平、交易开放等主要特征。在全球新一轮科技革命和产业变革中，互联网理念、先进信息技术与能源产业深度融合，正在推动能源互联网新技术、新模式和新业态的蓬勃兴起。',
        '能源互联网也是推动能源革命的重要战略支撑，对提高可再生能源比重、促进化石能源清洁高效利用、提升能源综合效率、推动能源市场开放和产业升级、形成新的经济增长点、提升能源国际合作水平具有重要意义。推动长三角一体化发展，能源(交通)是命脉、是基础，是重要的协同内容。上海凭借能源科技先发优势，对能源互联网的探索一直走在全国前列，经历了分布式能源的缘起、智能能源网的尝试、智能电网到微电网、多能互补再到智慧能源、能源互联网的发展历程，奠定了良好的物理基础。率先启动引领长三角能源互联网创新合作，将为长三角一体化发展全面“赋能”。',
        '实现气电融合与风光互补、藏能于民与供需响应',
        '2018年6月1日，长三角地区主要领导座谈会上发布《长三角地区一体化发展三年行动计划(2018-2020年)》，将能源互济互保作为七大重点合作领域之一。打造长三角能源互联网共同体，实现气电融合与风光互补、藏能于民与供需响应，有助于将长三角建成全球资源配置的亚太门户、成为具有全球竞争力的世界级城市群。具体来看，主要表现在以下几个方面：',
        '在消费层面，能源互联网创新用能方式，带动更加便捷、经济、普惠的用户服务，引导消费者用能行为和绿色消费方式，并倒逼生产者提供更公平、更丰富、更优质的能源服务。在生产层面，能源互联网可以提升传统能源系统效率，对接能源生产与消费侧，打通原有信息孤岛，推动能源系统更安全、清洁、高效、可持续。',
    ]},
    {id:4,date:'2019-07-04',title:'5G、互联网催动城市跨入智能时代｜世界人工智能大会国际智能城市论坛点亮城市未来',main:[
        '城市是人类最伟大的发明之一，城中的每一条街道，每一栋楼宇都容纳着生活在城中的人们的一切生活轨迹。人类社会的发展、进展，本质是技术的进步，随着第四次工业革命浪潮的到来，城市也向智能化不断迭代升级。人工智能将对于城市功能优化、帮助产业转型升级，同时在生活便捷安全方面发挥更大的作用。',
        '8月31日，由上海浦东智慧城市发展研究院、上海第一财经传媒有限公司、中国联合网络通信集团有限公司共同承办的2019国际智能城市峰会在上海开幕。上海市人民政府副秘书长，浦东新区区委副书记、区长杭迎伟、意大利米兰市副市长罗伯特科科、韩国首尔市经济政策室室长曹仁栋、中国工程院院士、同济大学副校长吴志强、上海市经济和信息化委员会副主任戎之勤、联合国工业发展组织贸易投资创新司司长贝尔纳多卡萨斯萨米安托、上海市浦东新区人民政府副区长徐惠丽、上海浦东智慧城市发展研究院执行院长盛雪锋、第一财经总编辑杨宇东、中国联合网络通信有限公司政企客户事业部总经理李广聚均出席上述会议。',
        '上海市人民政府副秘书长，浦东新区区委副书记、区长杭迎伟',
        '近年来，人工智能作为经济社会发展的新一代技术引擎，正在推动各领域从数字化、网络化向智能化加速跃升。上海和浦东全面推进互联网、大数据、人工智能和实体经济的深度融合，大力发展数字经济、共享经济，增强、培育新的增长点，形成新动能，全力打造国家人工智能发展的新高地。”杭迎伟表示，当前，城市之间的相互借鉴、相互协同，已经成为全球智能城市建设的重要力量。',
        '意大利米兰市副市长罗伯特科科',
        '“米兰和上海相比是一个小城市，居民人口是180万，每年我们有差不多1000万的旅客，超过20万的学生，其中有1万4千是留学生。”罗伯特科科表示，打算从5G等基础设施入手，建立起数据之间的联系，把所有的数据连接起来，从而能够得以利用，让它们能够用于各种服务。',
        '据悉，智慧城市基于信息交流的技术、通信的技术，除了为人们提供更为便捷的服务之外，也给企业提供更多机会，让城市变的更加可持续。城市正在大力建设智慧城市的基础设施，通过一些智慧的服务来实现。',
        '城市在智慧城市发展方向上处在不同的阶段，一个智慧的城市可以有不同的阶段。如果说把智慧城市作为一个网络来看的话，里面各个参与方会有一些有效的互动，它是一个网络。这个网络需要分享，改善人民的生活，让企业也变得更加有竞争力。',
        '5G有三大重要的特点：大带宽、大连接、低时延。李广聚表示，预计在今年三季度，中国就会把5G的服务开始全面商业开放，主要是把大带宽的性能在网络服务上提供；预计明年一季度，服务就能够延伸到低时延和大连接，这两个场景。而低时延和大连接这两个场景对于智慧城市非常关键。'
    ]},
    {id:5,date:'2019-07-04',title:'反“网络霸王条款”需要互联网思维',main:[
        '在移动互联网、人工智能、大数据等新技术飞速发展的当下，新模式、新业态、新产业接踵而现。与此同时，新的消费纠纷不断涌现。点餐时需要下载客户端、在线预订没享受到服务却遭遇商家不退款、APP不给授权就不提供服务……这类“网络霸王条款”让很多消费者措手不及心塞不已。',
        '如今，越来越多的消费者和商家都向网上转移，与网络有关的消费侵权行为自然越来越多，再加上相关法律法规和行政监管还没有完全适应互联网时代的新模式、新业态、新产业，就会出现越来越多商家通过“网络霸王条款”等去实现利益最大化，而消费者则变成了新型“霸王条款”的受害者。',
        '虽然新型“霸王条款”与传统“霸王条款”本质是一样的，都是商家单方面制定消费规则、任意扩大经营者权限，排除、剥夺消费者权利等，看上去也在现有法律法规约束范围之内，但是，新型“霸王条款”更有互联网特点，侵权方式也更为隐蔽，这就增加了监管的难度以及消费者维权的成本。',
        '眼下亟须完善《消费者权益保护法》《合同法》等法律法规，使法律能更好地适应互联网发展。比如《消费者权益保护法》中规定“经营者不得以格式条款、通知、声明、店堂告示等方式”，这些方式都是传统“霸王条款”方式，没有把互联网商家新侵权方式写入法律，自然对这类商家缺少震慑。',
        '市场监管的重点也应从线下向线上转移。由于网络时代商家的侵权方式不同，监管者也要尽快适应新模式、新业态、新产业背景下的侵权方式。无论是完善法律还是改革市场监管，都要有互联网思维，即便市场监管不能完全跟上互联网经营及消费发展脚步，也不能严重滞后于互联网消费发展。',
        '应当看到，互联网技术发展虽然为商家侵犯消费者权益提供了便利和机会，但如果监管者善于利用互联网、大数据等新技术反“网络霸王条款”，就能弥补监管力量不足。如果监管者自身技术监管能力不足，可通过购买公共服务等方式与技术能力强的市场主体合作，借助市场技术优势防范消费侵权。',
        '在监管层面，还可以考虑分类、分级设立消费侵权黑名单。比如在线旅游预订、餐饮类APP等，都应该纳入白黑名单管理，不管是“霸王条款”还是因其他侵权行为被消费者投诉，一旦达到规定标准都应该列入黑名单，有关方面应当随时在相关网站上公布黑名单，或者向行业消费者定期推送黑名单。',
        '此外，如何利用消费者（用户）的力量反“网络霸王条款”值得思考。尽管互联网时代商家侵权方式更多样更隐蔽，但消费者无处不在，如果能善用消费者力量，就可以对商家网络侵权行为形成有效打击，比如强制每个消费类APP都设置一键投诉，投诉内容实现共享——监管者、消费者都能看到。',
        '虽然包括“网络霸王条款”在内的商家侵权行为，借助互联网可以有“七十二变”，但只要监管者变成“聪明的猎人”，还是可以有效治理的。当然，这需要更多消费者主动参与反侵权行动，同时要做好与网络消费侵权现象打“持久战”的准备。'
    ]}
]

export let getBeforeNewList=(pageSize,pageNumber)=>{//分页查询
    pageSize-=1;
    return newList.slice(pageSize*pageNumber,pageSize*pageNumber+pageNumber);
}
export let getNewsListSize=()=>{//总条数
    return newList.length;
}
export let getIndexNews=(value)=>{//根据id获取新闻
    return newList.filter(item=>{
        return item.id==value;
    })
}